


let count= parseInt(prompt("Студенттер санын енгізіңіз:"));


let student = 0; //қөге тең
let i = 1;


while (i <= count)  {  
    let grade = +prompt(i + "-студенттің бағасын енгізіңіз:");
    student += grade; //бағаны бірдеңеге(короче ана берген атқа ма сондайдың ) мәніне қосу
    i++;  
}// студенттің санын қанша енгізсең сонша студенттің бағасын сұрайды


let result = student / count; //барлық сандардың мәнін бір-біріне қосып жалпы санның санына бөлеміз


alert("Студенттердің бағаларының орташа мәні: " + result); //мынау шыққан нәтиже